# Taps
tap "homebrew/bundle"

# Terminal & Shell
brew "bash"
brew "zsh"
brew "starship"
brew "eza"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Terminal Multiplexer
brew "tmux"

# Editor
brew "neovim"

# Formatters (for Neovim)
brew "black"
brew "prettier"

# GUI Applications
cask "ghostty"
cask "karabiner-elements"
cask "font-jetbrains-mono-nerd-font"

# Productivity & Utilities
cask "1password"
cask "alt-tab"
cask "google-chrome"
cask "logitech-g-hub"

# Creative & Media
cask "inkscape"
cask "obs"

# Communication
cask "whatsapp"
